In [2]:
import pandas as pd

csv_1 = pd.read_csv("D:\\Panda\\Test_1.csv")

csv_1

   a  b  c
0  1  3  q
1  2  4  r
2  3  5  y
3  4  6  t
4  5  6  u

In [3]:
#number of index
csv_1.index

RangeIndex(start=0, stop=5, step=1)

In [5]:
#name of colummns
csv_1.columns

Index(['a', 'b', 'c'], dtype='object')

get all information

In [6]:
csv_1.describe()

              a        b
count  5.000000  5.00000
mean   3.000000  4.80000
std    1.581139  1.30384
min    1.000000  3.00000
25%    2.000000  4.00000
50%    3.000000  5.00000
75%    4.000000  6.00000
max    5.000000  6.00000

head function

In [8]:
csv_1.head(2) #to get limited or desired number of data from above

   a  b  c
0  1  3  q
1  2  4  r

tail function

In [10]:
csv_1.tail(3)  #data from below

   a  b  c
2  3  5  y
3  4  6  t
4  5  6  u

the ratio wala function

In [12]:
#to get data in-between

csv_1[2:4]

   a  b  c
2  3  5  y
3  4  6  t

get all the data as numpy

In [13]:
csv_1.to_numpy()

array([[1, 3, 'q'],
       [2, 4, 'r'],
       [3, 5, 'y'],
       [4, 6, 't'],
       [5, 6, 'u']], dtype=object)

In [14]:
#2nd mehtod

import numpy as np

v = np.asarray(csv_1)
v

array([[1, 3, 'q'],
       [2, 4, 'r'],
       [3, 5, 'y'],
       [4, 6, 't'],
       [5, 6, 'u']], dtype=object)

Data Sorting

In [15]:
#descending order

csv_1.sort_index(axis = 0, ascending = False)

   a  b  c
4  5  6  u
3  4  6  t
2  3  5  y
1  2  4  r
0  1  3  q

# Change particular element data

In [16]:
csv_1["b"][2] = "new"  #[column name][column wise index ]

csv_1 #got the warning because this is not a right way to do this

C:\Users\gorav\AppData\Local\Temp\ipykernel_18004\1586423724.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  csv_1["b"][2] = "new"
C:\Users\gorav\AppData\Local\Temp\ipykernel_18004\1586423724.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  csv_1["b"][2] = "new"
C:\Users\gorav\AppData\Local\Temp\ipykernel_18004\1586423724.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'new' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  csv_1["b"][2] = "new"

   a    b  c
0  1    3  q
1  2    4  r
2  3  new  y
3  4    6  t
4  5    6  u

In [18]:
#2nd method

csv_1.loc[2,"b"] = "new_2"  #[row, column name]

csv_1

   a      b  c
0  1      3  q
1  2      4  r
2  3  new_2  y
3  4      6  t
4  5      6  u

# Get particular Set of Data

In [19]:
csv_1.loc[[1,2],["b","c"]]  #[indexs of rows],[name of coulumns]

       b  c
1      4  r
2  new_2  y

In [20]:
csv_1.loc[[1,2],:] #all data of row 1,2

   a      b  c
1  2      4  r
2  3  new_2  y

In [21]:
csv_1.loc[:,["b","c"]] #all data of column b, c

       b  c
0      3  q
1      4  r
2  new_2  y
3      6  t
4      6  u

more precisely one element

In [22]:
csv_1.iloc[2,1] #[index of row][index of col]

'new_2'

# Remove Row or column completely

In [24]:
csv_1.drop(2, axis = 0)
#row  2 removed

   a  b  c
0  1  3  q
1  2  4  r
3  4  6  t
4  5  6  u

In [27]:
csv_1.drop("b", axis = 1)
#col b removed

   a  c
0  1  q
1  2  r
2  3  y
3  4  t
4  5  u

# handling Missing value (dropna & fillna)

In [ ]:
dropna() #to remove column & row in which any data is missing
#too many paramters

# handling missing value (replace & interpolate)